### 1.Data Definition Language(DDL)

In [2]:

# create table
CREATE TABLE employee(emp_id int, first_name varchar(20), last_name varchar(20), salary int, primary key(emp_id));
select * from employee;  # show the table 
describe employee;       # show logical structural of table

## add new column in table
ALTER TABLE employee ADD COLUMN contact int(10);
describe employee;

## Rename the column
ALTER TABLE employee RENAME COLUMN contact to pin_code;
describe employee;

## truncate table
TRUNCATE TABLE employee;    # delete all table

## drop
DROP TABLE employee;

SyntaxError: invalid syntax (<ipython-input-2-bf3f88365f0b>, line 2)

### 2. Data Manipulation Language (DML)

In [1]:
## Insert data
CREATE TABLE employee(emp_id int, first_name VARCHAR(20), last_name VARCHAR(20), salary int, primary key(emp_id));
INSERT INTO employee(emp_id, first_name,last_name,salary) VALUES(101, "Steven", "King", 10000);
INSERT INTO employee(emp_id, first_name,last_name,salary) VALUES(102, "Edwin", "Thomas", 15000);
INSERT INTO employee(emp_id, first_name,last_name,salary) VALUES(103, "Harry", "Pottor", 20000);
INSERT INTO employee(emp_id, first_name,last_name,salary) VALUES(104, "Charlie", "sheen",30000);
INSERT INTO employee(emp_id, first_name,last_name,salary) VALUES(105, "matt", "demon", 45000);
INSERT INTO employee(emp_id, first_name,last_name,salary) VALUES(106, "jenifier", "lopez", 50000);

select * from employee;

## update
UPDATE employee SET last_name="vishwa" WHERE emp_id=102;   # update the name "thomas" to "vishwa"
select * from employee;

## delete command
DELETE FROM employee WHERE emp_id IN (101,103);  # delete 101 and 103 rows

SyntaxError: invalid syntax (<ipython-input-1-23e4622c0f93>, line 2)

### 3. Data Control Language(DCL)

In [2]:
## Grant
GRANT <Privilege list> ON <Relation Name> TO <USER>

# Revoke
REVOKE <Privilege list> ON <Relation Name> TO <USER>

SyntaxError: invalid syntax (<ipython-input-2-e081ee3c17d3>, line 2)

### 4. SQL Operators

In [3]:
1.## WHERE
used to specify a condition while fetching the data or by joininig with multiple tables.
Not only used in SELECT statement , but it is also used in the UPDATE, DELETE statement etc.

SELECT * FROM employee WHERE emp_id = 101;     # get only 101 emp_id rows

2. ## Logical operator

AND      (5<2) AND (5>3)      False
OR       (5<2) OR (5>3)       True
NOT      NOT(5<2)             True

SELECT * From employee WHERE first_name = "Steven" and salary = 10000;

SELECT * From employee WHERE first_name = "Steven" OR last_name = "King";

SELECT * From employee WHERE first_name = "Steven" and salary != 10000;

3. ## Comparison operator

> greater than, >= greater than or equal to, < less than , <= less than or equal to, <> or != NOT equal to

SELECT * From employee WHERE salary <= 30000;

4. ## Special operator

BETWEEN     checks an attribute value within range
LIKE        Checks an attribute value matches a given string pattern
IS NULL     checks an attributes value is NULL
IN          checks an attributes value matches any value within a value list
DISTINCT    Limit values to unique values

SELECT * From employee WHERE salary between 10000 and 30000;

SELECT * From employee WHERE first_name like "Steven";

SELECT * From employee WHERE salary is null;

SELECT * From employee WHERE salary in (10000, 30000, 45000);

SELECT DISTINCT (first_name) from employee;     # give only first_name of all the rows

5. ## Aggregation operators

Avg()     Return the average value from specified columns
count()   Returns number of table rows
Max()     Return Largest value among the records
MIN()     Return smallest value amoung the records
Sum()     Returns the sum of specified column values

SELECT avg(salary) FROM employee;

SELECT Count(salary) FROM employee;

SELECT Max(salary) FROM employee;

SELECT Min(salary) FROM employee;

SELECT Sum(salary) FROM employee;

SyntaxError: invalid syntax (<ipython-input-3-de49866e3eed>, line 2)

### 5. Group BY Clause, Having, order by

In [5]:
CREATE TABLE employee(emp_id int, first_name VARCHAR(20), last_name VARCHAR(20), salary int, dept varchar(20),
                      primary key(emp_id));
INSERT INTO employee(emp_id, first_name,last_name,salary,dept) VALUES(101, "Steven", "King", 10000,"sales");
INSERT INTO employee(emp_id, first_name,last_name,salary,dept) VALUES(102, "Edwin", "Thomas", 15000,"tech");
INSERT INTO employee(emp_id, first_name,last_name,salary,dept) VALUES(103, "Harry", "Pottor", 20000,"sales");
INSERT INTO employee(emp_id, first_name,last_name,salary,dept) VALUES(104, "Charlie", "sheen",30000,"marketing");
INSERT INTO employee(emp_id, first_name,last_name,salary,dept) VALUES(105, "matt", "demon", 45000,"tech");
INSERT INTO employee(emp_id, first_name,last_name,salary,dept) VALUES(106, "jenifier", "lopez",50000,"support");

## Group by
SELECT first_name, max(salary), dept  from employee group by dept;

## having
SELECT first_name, max(salary), dept  from employee group by dept having count(dept)>=2;

## order by
-used to sort output of select statement
-Default is to sort in ASC (Ascennding)
-Can sort in Reverse (Descending) order with "DESC" after the column name.

SELECT * from employee order by salary desc;   # salary column will come in decending order

SyntaxError: invalid syntax (<ipython-input-5-aac81a5dab0d>, line 1)

In [ ]:
### excercise

CREATE TABLE dataofcustomer(
custid VARCHAR(6)  PRIMARY KEY,
fname VARCHAR(50),
mname VARCHAR(30),
ltname VARCHAR(30),
city VARCHAR(15),
age int(10),
mobileno VARCHAR(10),
occupation VARCHAR(10),
dob DATE
);
INSERT INTO dataofcustomer VALUES('C00001','Ramesh','Chandra','Sharma','Delhi',45,'9543198345','Service','1976-12-06');
INSERT INTO dataofcustomer VALUES('C00002','Avinash','Sunder','Minha','Delhi',32,'9876532109','Service','1974-10-16');
INSERT INTO dataofcustomer VALUES('C00003','Rahul',null,'Rastogi','Delhi',24,'9765178901','Student','1981-09-26');
INSERT INTO dataofcustomer VALUES('C00004','Parul',null,'Gandhi','Delhi',46,'9876532109','Housewife','1976-11-03');
INSERT INTO dataofcustomer VALUES('C00005','Naveen','Chandra','Aedekar','Mumbai',23,'8976523190','Service','1976-09-19');
INSERT INTO dataofcustomer VALUES('C00006','Chitresh',null,'Barwe','Mumbai',18,'7651298321','Student','1992-11-06');
INSERT INTO dataofcustomer VALUES('C00007','Amit','Kumar','Borkar','Mumbai',76,'9875189761','Student','1981-09-06');
INSERT INTO dataofcustomer VALUES('C00008','Nisha',null,'Damle','Mumbai',43,'7954198761','Service','1975-12-03');
INSERT INTO dataofcustomer VALUES('C00009','Abhishek',null,'Dutta','Kolkata',67,'9856198761','Service','1973-05-22');
INSERT INTO dataofcustomer  VALUES('C00010','Shankar',null,'Nair','Chennai',90,'8765489076','Service','1976-07-12'); 

select * from dataofcustomer;
select min(age) from dataofcustomer;
select fname from dataofcustomer where age = 18;
select max(age)  from dataofcustomer;
select fname from dataofcustomer where age = 90;
select  count(*) from dataofcustomer;              # how many data in table
select count(fname),city from dataofcustomer group by city;


select count(fname),city from dataofcustomer group by city having count(fname)>2;
select count(fname),city from dataofcustomer group by city having count(fname)=2;
select count(fname),city from dataofcustomer group by city having count(fname)>2;
select count(fname),city from dataofcustomer group by city having count(fname)<2;
select count(fname),city from dataofcustomer group by city having count(fname)!=4;

### 6. UNION

In [6]:
1. ## UNION

#product1
CREATE TABLE product1(category_id int, product_name VARCHAR(20));

INSERT INTO product1 VALUES(1, "sumsung");
INSERT INTO product1 VALUES(2, "nokia");
INSERT INTO product1 VALUES(3, "hp");
INSERT INTO product1 VALUES(5, "nikon");

#product 2
CREATE TABLE product2(category_id int, product_name VARCHAR(20));

INSERT INTO product2 VALUES(1, "nokia");
INSERT INTO product2 VALUES(2, "LG");
INSERT INTO product2 VALUES(3, "hp");
INSERT INTO product2 VALUES(4, "dell");
INSERT INTO product2 VALUES(6, "apple");
INSERT INTO product2 VALUES(7, "lenovo");

# get union value of both product
SELECT product_name from product1
union
select product_name from product2;

2. ## UNION ALL
SELECT product_name from product1
union
select product_name from product2;

SyntaxError: invalid syntax (<ipython-input-6-e5e16098d9d3>, line 4)

### 7. SQL Joins

In [ ]:
Combine rows/columns from two or more tables, based on a related column between them in a database.



CREATE TABLE employee(emp_id int, first_name VARCHAR(20), last_name VARCHAR(20), salary int, dept varchar(20),
                      primary key(emp_id));
INSERT INTO employee(emp_id, first_name,last_name,salary,dept) VALUES(101, "Steven", "King", 10000,"sales");
INSERT INTO employee(emp_id, first_name,last_name,salary,dept) VALUES(102, "Edwin", "Thomas", 15000,"tech");
INSERT INTO employee(emp_id, first_name,last_name,salary,dept) VALUES(103, "Harry", "Pottor", 20000,"hr");
INSERT INTO employee(emp_id, first_name,last_name,salary,dept) VALUES(104, "Charlie", "sheen",30000,"marketing");
INSERT INTO employee(emp_id, first_name,last_name,salary,dept) VALUES(105, "matt", "demon", 45000,"tech");
INSERT INTO employee(emp_id, first_name,last_name,salary,dept) VALUES(106, "jenifier", "lopez",50000,"support");

CREATE TABLE department(dept_id int, dept VARCHAR(20), dept_loc varchar(20));
INSERT INTO department VALUES(1, "content", "chicago");
INSERT INTO department VALUES(2, "support", "new jearsey");
INSERT INTO department VALUES(3, "sales", "bostan");
INSERT INTO department VALUES(4, "hr", "chicago");
INSERT INTO department VALUES(5, "operation", "new york");

## Inner join
select e.first_name,e.salary,d.dept,d.dept_loc
from employee e
inner join department d
on e.dept=d.dept;

## Left join
select e.first_name,e.salary,d.dept,d.dept_loc
from employee e
left join department d
on e.dept=d.dept;

## Right join
select e.first_name,e.salary,d.dept,d.dept_loc
from employee e
right join department d
on e.dept=d.dept;

## full outer join
select e.first_name,e.salary,d.dept,d.dept_loc
from employee e
left join department d
on e.dept=d.dept
union
select e.first_name,e.salary,d.dept,d.dept_loc
from employee e
right join department d
on e.dept=d.dept;

## cross join
select * from employee cross join department;